app/controllers/admin/arts_controller.rb

	def index
		@arts = Art.all.reverse_order
---
SELECT "arts".* FROM "arts" ORDER BY "arts"."id" DESC

	def create
		@art = Art.new(art_params)
		@art.art_images.build
		if @art.save
---
INSERT INTO "art_images" ("art_id", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?)  [["art_id", 1], ["created_at", "2018-01-24 09:41:00.564111"], ["updated_at", "2018-01-24 09:41:00.564111"], ["image_id", "a184563781158385a22739366e1c77de8f5176ca3815201aaf1c9a19334d"]]
INSERT INTO "arts" ("event_name", "artist_name", "start_date", "end_date", "event_info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def destroy
		@art.destroy
---
DELETE FROM "arts" WHERE "arts"."id" = ?  [["id", 2]]