app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" DESC
---
	def index
		@products = Product.all.reverse_order

SELECT "products".* FROM "products" WHERE (gender = 'Ladys') ORDER BY "products"."id" DESC
---
	def show
		@products = Product.where('gender = ?', params[:gender]).reverse_order

UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 4200], ["updated_at", "2018-01-27 08:18:54.267449"], ["id", 8]]
---
	def update
    	if @product.update(product_params)

INSERT INTO "product_images" ("product_id", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?)  [["product_id", 1], ["created_at", "2018-01-23 11:57:20.564847"], ["updated_at", "2018-01-23 11:57:20.564847"], ["image_id", "390ce82e9f561e97a76622c16cdeeb4b49c1ae6e13ec1e54e14f4c8857c2"]]
INSERT INTO "products" ("product_name", "price", "gender", "size", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product_name", "test"], ["price", 200], ["gender", "Ladys"], ["size", "S"], ["created_at", "2018-01-27 11:30:05.236938"], ["updated_at", "2018-01-27 11:30:05.236938"], ["status", nil]]
---
	def create
		@product = Product.new(product_params)
		@product.product_images.build
		if @product.save

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]
---
	def destroy
		@product.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "products" SET "statuss" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["statuss", 1], ["updated_at", "2018-01-28 05:09:36.217062"], ["id", 23]]
---
 	def toggle_statuss
 		@product = Product.find_by(id: params[:product_id])
		@product.toggle_statuss!