app/controllers/admin/snaps_controller.rb

SELECT "snaps".* FROM "snaps" ORDER BY "snaps"."id" DESC
---
	def index
		@snaps = Snap.all.reverse_order

SELECT "genres".* FROM "genres"
---
	def new
		@snap = Snap.new
		@snap.snap_images.build
		@snap.items.build
		@genres = Genre.all

INSERT INTO "snap_images" ("snap_id", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?)  [["snap_id", 1], ["created_at", "2018-01-27 06:23:20.070722"], ["updated_at", "2018-01-27 06:23:20.070722"], ["image_id", "bf61ba57618c35e7ff50326a94597a561b80b4a93092cd149a823369ebee"]]
INSERT INTO "snaps" ("snap_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["snap_name", "hinaさん"], ["created_at", "2018-01-27 06:23:20.034222"], ["updated_at", "2018-01-27 06:23:20.034222"]]
---
	def create
		@snap = Snap.new(snap_params)
		@snap.snap_images.build
		if @snap.save

DELETE FROM "snaps" WHERE "snaps"."id" = ?  [["id", 1]]
---
	def destroy
		@snap.destroy