app/views/admin/snaps/_item_form.html.erb

<div>
	<%= f.collection_select :genre_id, Genre.all, :id, :genre_name, {} ,{:class => "form-control genre-area", :style =>"width: 200px; display: inline-block; margin: 5px 0 0 30px;"} %>
---
SELECT "genres".* FROM "genres"