app/views/admin/snaps/index.html.erb

							<ul class="snapshotimage">
								<% snap.snap_images.each do |image| %>
---
SELECT "snap_images".* FROM "snap_images" WHERE "snap_images"."snap_id" = ?  [["snap_id", 1]]
SELECT "snaps".* FROM "snaps" ORDER BY "snaps"."id" DESC

							<th class="snapname"><%= snap.snap_name %></th>
							<% snap.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."snap_id" = ?  [["snap_id", 1]]