app/views/arts/index.html.erb

					<ul class="event-photo">
						<% art.art_images.each do |image| %>
---
SELECT "art_images".* FROM "art_images" WHERE "art_images"."art_id" = ?  [["art_id", 1]]
SELECT "arts".* FROM "arts" ORDER BY "arts"."id" DESC