app/views/admin/products/show.html.erb

SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ?  [["product_id", 20]]
SELECT "products".* FROM "products" WHERE (gender = 'Ladys') ORDER BY "products"."id" DESC
---
								<ul class="productimage">
									<% product.product_images.each do |image| %>