app/controllers/arts_controller.rb

SELECT "arts".* FROM "arts" ORDER BY "arts"."id" DESC
SELECT  "arts".* FROM "arts" ORDER BY "arts"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
	def index
		@arts = Art.all
		@arts = Art.page(params[:page]).reverse_order