app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" DESC
SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
	def index
		@products = Product.all
		@products = Product.page(params[:page]).reverse_order

SELECT "products".* FROM "products" WHERE (gender = '#<Product::ActiveRecord_Relation:0x0a6bf6e8>') ORDER BY "products"."id" DESC
---
	def show
		@product = Product.find(params[:id])