app/controllers/snaps_controller.rb

	def index
		@snaps = Snap.all
		@snaps = Snap.page(params[:page]).reverse_order
---
SELECT "snaps".* FROM "snaps" ORDER BY "snaps"."id" DESC
SELECT  "snaps".* FROM "snaps" ORDER BY "snaps"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "snaps"