app/views/products/index.html.erb

								<ul class="productimage">
									<% product.product_images.each do |image| %>
---
SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ?  [["product_id", 8]]
SELECT "products".* FROM "products" ORDER BY "products"."id" DESC