app/views/products/show.html.erb

SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ?  [["product_id", 21]]
SELECT "products".* FROM "products" WHERE (gender = '#<Product::ActiveRecord_Relation:0x0a6bf6e8>') ORDER BY "products"."id" DESC
---
								<ul class="productimage">
									<% product.product_images.each do |image| %>