app/views/admin/arts/index.html.erb

SELECT "art_images".* FROM "art_images" WHERE "art_images"."art_id" = ?  [["art_id", 1]]
SELECT "arts".* FROM "arts" ORDER BY "arts"."id" DESC
---
				<ul class="event-photo">
					<% art.art_images.each do |image| %>